package day0302;
// 자료형(Data Type)
// 자료형이란 해당 공간(변수 혹은 상수)에 어떤 종류의 값이 저장 가능한지를 저장하는 것이다.
// 자료형에는 크게 기본형 데이터타입(Primitive Data Type)(원시의)과 참조형 데이터타입(Reference Data Type)이 존재한다.
// 기본형 데이터타입: 실제 값을 2진법으로 변환하여 해당 공간에 저장한다.
// (실제 값 직접 저장됨)
// 기본형 데이터타입에는 정수형, 실수형, 문자형, 논리형 4가지 종류가 존재한다.
// 정수형: byte short int long
// 실수형: float double
// 문자형: char
// 논리형: boolean
// 기본형 데이터타입은 이렇게 8가지 종류만 존재한다.

// 참조형 데이터타입: 실제 값은 별개의 공간에 저장되고, 변수 혹은 상수에는 그 공간에 접근할 수 있도록
// 별개 공간의 메모리 주소값이 저장이 된다.
// (실제 값이 별개 공간에 저장되고 메모리 위치의 정보를 참조해서 값을 가져옴)
// 참조형 데이터타입에는 클래스형, 배열형, 인터페이스형 3가지 종류가 존재한다.
// 클래스형의 예로는 String이 있다.
public class Ex06DataType {

}
